sunklCoin/MCU/board/pin_mux.h
#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_


/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* SPIFI_CLK (coord M13), J13[2]/U27[6]/P0_26-SPIFI_CLK */
#define BOARD_INITSPIFIPINS_SPIFI_CLK_PERIPHERAL                          SPIFI0   /*!< Device name: SPIFI0 */
#define BOARD_INITSPIFIPINS_SPIFI_CLK_SIGNAL                           SPIFI_SCK   /*!< SPIFI0 signal: SPIFI_SCK */
#define BOARD_INITSPIFIPINS_SPIFI_CLK_PIN_NAME                         SPIFI_CLK   /*!< Pin name */
#define BOARD_INITSPIFIPINS_SPIFI_CLK_LABEL      "J13[2]/U27[6]/P0_26-SPIFI_CLK"   /*!< Label */
#define BOARD_INITSPIFIPINS_SPIFI_CLK_NAME                           "SPIFI_CLK"   /*!< Identifier name */

/* SPIFI_IO(0) (coord M7), J13[6]/U27[5]/P0_24-SPIFI_IO0 */
#define BOARD_INITSPIFIPINS_SPIFI_IO0_PERIPHERAL                          SPIFI0   /*!< Device name: SPIFI0 */
#define BOARD_INITSPIFIPINS_SPIFI_IO0_SIGNAL                SPIFI_IO0/SPIFI_MOSI   /*!< SPIFI0 signal: SPIFI_IO0/SPIFI_MOSI */
#define BOARD_INITSPIFIPINS_SPIFI_IO0_PIN_NAME                       SPIFI_IO(0)   /*!< Pin name */
#define BOARD_INITSPIFIPINS_SPIFI_IO0_LABEL      "J13[6]/U27[5]/P0_24-SPIFI_IO0"   /*!< Label */
#define BOARD_INITSPIFIPINS_SPIFI_IO0_NAME                           "SPIFI_IO0"   /*!< Identifier name */

/* SPIFI_IO(1) (coord K8), J13[4]/U27[2]/P0_25-SPIFI_IO1 */
#define BOARD_INITSPIFIPINS_SPIFI_IO1_PERIPHERAL                          SPIFI0   /*!< Device name: SPIFI0 */
#define BOARD_INITSPIFIPINS_SPIFI_IO1_SIGNAL                SPIFI_IO1/SPIFI_MISO   /*!< SPIFI0 signal: SPIFI_IO1/SPIFI_MISO */
#define BOARD_INITSPIFIPINS_SPIFI_IO1_PIN_NAME                       SPIFI_IO(1)   /*!< Pin name */
#define BOARD_INITSPIFIPINS_SPIFI_IO1_LABEL      "J13[4]/U27[2]/P0_25-SPIFI_IO1"   /*!< Label */
#define BOARD_INITSPIFIPINS_SPIFI_IO1_NAME                           "SPIFI_IO1"   /*!< Identifier name */

/* SPIFI_IO(3) (coord L9), J13[12]/U27[7]/P0_27-SPIFI_IO3 */
#define BOARD_INITSPIFIPINS_SPIFI_IO3_PERIPHERAL                          SPIFI0   /*!< Device name: SPIFI0 */
#define BOARD_INITSPIFIPINS_SPIFI_IO3_SIGNAL                            SPIFI_IO   /*!< SPIFI0 signal: SPIFI_IO */
#define BOARD_INITSPIFIPINS_SPIFI_IO3_CHANNEL                                  3   /*!< SPIFI0 SPIFI_IO channel: 3 */
#define BOARD_INITSPIFIPINS_SPIFI_IO3_PIN_NAME                       SPIFI_IO(3)   /*!< Pin name */
#define BOARD_INITSPIFIPINS_SPIFI_IO3_LABEL     "J13[12]/U27[7]/P0_27-SPIFI_IO3"   /*!< Label */
#define BOARD_INITSPIFIPINS_SPIFI_IO3_NAME                           "SPIFI_IO3"   /*!< Identifier name */

/* SPIFI_IO(2) (coord M9), J13[10]/U27[3]/P0_28-SPIFI_IO2-USB0_OCURRn */
#define BOARD_INITSPIFIPINS_SPIFI_IO2_PERIPHERAL                          SPIFI0   /*!< Device name: SPIFI0 */
#define BOARD_INITSPIFIPINS_SPIFI_IO2_SIGNAL                            SPIFI_IO   /*!< SPIFI0 signal: SPIFI_IO */
#define BOARD_INITSPIFIPINS_SPIFI_IO2_CHANNEL                                  2   /*!< SPIFI0 SPIFI_IO channel: 2 */
#define BOARD_INITSPIFIPINS_SPIFI_IO2_PIN_NAME                       SPIFI_IO(2)   /*!< Pin name */
#define BOARD_INITSPIFIPINS_SPIFI_IO2_LABEL "J13[10]/U27[3]/P0_28-SPIFI_IO2-USB0_OCURRn" /*!< Label */
#define BOARD_INITSPIFIPINS_SPIFI_IO2_NAME                           "SPIFI_IO2"   /*!< Identifier name */

/* SPIFI_CSN (coord N7), J13[8]/U27[1]/P0_23-SPIFI_CSn-MCLK */
#define BOARD_INITSPIFIPINS_SPIFI_CSn_PERIPHERAL                          SPIFI0   /*!< Device name: SPIFI0 */
#define BOARD_INITSPIFIPINS_SPIFI_CSn_SIGNAL                           SPIFI_CSN   /*!< SPIFI0 signal: SPIFI_CSN */
#define BOARD_INITSPIFIPINS_SPIFI_CSn_PIN_NAME                         SPIFI_CSN   /*!< Pin name */
#define BOARD_INITSPIFIPINS_SPIFI_CSn_LABEL "J13[8]/U27[1]/P0_23-SPIFI_CSn-MCLK"   /*!< Label */
#define BOARD_INITSPIFIPINS_SPIFI_CSn_NAME                           "SPIFI_CSn"   /*!< Identifier name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSPIFIPins(void); /* Function assigned for the Cortex-M4F */

/* EMC_A(14) (coord P9), U28[G8]/P3_25-EMC_A14 */
#define BOARD_INITSDRAMPINS_EMC_A14_PERIPHERAL                               EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_A14_SIGNAL                                 EMC_A   /*!< EMC signal: EMC_A */
#define BOARD_INITSDRAMPINS_EMC_A14_CHANNEL                                   14   /*!< EMC EMC_A channel: 14 */
#define BOARD_INITSDRAMPINS_EMC_A14_PIN_NAME                           EMC_A(14)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_A14_LABEL                "U28[G8]/P3_25-EMC_A14"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_A14_NAME                               "EMC_A14"   /*!< Identifier name */

/* EMC_A(13) (coord M12), U28[G7]/P1_25-EMC_A13 */
#define BOARD_INITSDRAMPINS_EMC_A13_PERIPHERAL                               EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_A13_SIGNAL                                 EMC_A   /*!< EMC signal: EMC_A */
#define BOARD_INITSDRAMPINS_EMC_A13_CHANNEL                                   13   /*!< EMC EMC_A channel: 13 */
#define BOARD_INITSDRAMPINS_EMC_A13_PIN_NAME                           EMC_A(13)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_A13_LABEL                "U28[G7]/P1_25-EMC_A13"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_A13_NAME                               "EMC_A13"   /*!< Identifier name */

