sunklCoin/MCU/board/pin_mux.h
/* EMC_A(11) (coord M10), U28[G2]/P1_23-EMC_A11 */
#define BOARD_INITSDRAMPINS_EMC_A11_PERIPHERAL                               EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_A11_SIGNAL                                 EMC_A   /*!< EMC signal: EMC_A */
#define BOARD_INITSDRAMPINS_EMC_A11_CHANNEL                                   11   /*!< EMC EMC_A channel: 11 */
#define BOARD_INITSDRAMPINS_EMC_A11_PIN_NAME                           EMC_A(11)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_A11_LABEL                "U28[G2]/P1_23-EMC_A11"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_A11_NAME                               "EMC_A11"   /*!< Identifier name */

/* EMC_A(10) (coord B7), U28[H9]/P1_16-EMC_A10 */
#define BOARD_INITSDRAMPINS_EMC_A10_PERIPHERAL                               EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_A10_SIGNAL                                 EMC_A   /*!< EMC signal: EMC_A */
#define BOARD_INITSDRAMPINS_EMC_A10_CHANNEL                                   10   /*!< EMC EMC_A channel: 10 */
#define BOARD_INITSDRAMPINS_EMC_A10_PIN_NAME                           EMC_A(10)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_A10_LABEL                "U28[H9]/P1_16-EMC_A10"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_A10_NAME                               "EMC_A10"   /*!< Identifier name */

/* EMC_A(9) (coord F10), U28[G3]/P1_27-EMC_A9 */
#define BOARD_INITSDRAMPINS_EMC_A9_PERIPHERAL                                EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_A9_SIGNAL                                  EMC_A   /*!< EMC signal: EMC_A */
#define BOARD_INITSDRAMPINS_EMC_A9_CHANNEL                                     9   /*!< EMC EMC_A channel: 9 */
#define BOARD_INITSDRAMPINS_EMC_A9_PIN_NAME                             EMC_A(9)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_A9_LABEL                  "U28[G3]/P1_27-EMC_A9"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_A9_NAME                                 "EMC_A9"   /*!< Identifier name */

/* EMC_A(8) (coord J10), U28[H1]/P1_26-EMC_A8 */
#define BOARD_INITSDRAMPINS_EMC_A8_PERIPHERAL                                EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_A8_SIGNAL                                  EMC_A   /*!< EMC signal: EMC_A */
#define BOARD_INITSDRAMPINS_EMC_A8_CHANNEL                                     8   /*!< EMC EMC_A channel: 8 */
#define BOARD_INITSDRAMPINS_EMC_A8_PIN_NAME                             EMC_A(8)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_A8_LABEL                  "U28[H1]/P1_26-EMC_A8"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_A8_NAME                                 "EMC_A8"   /*!< Identifier name */

/* EMC_A(7) (coord P8), U28[H2]/P1_8-EMC_A7 */
#define BOARD_INITSDRAMPINS_EMC_A7_PERIPHERAL                                EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_A7_SIGNAL                                  EMC_A   /*!< EMC signal: EMC_A */
#define BOARD_INITSDRAMPINS_EMC_A7_CHANNEL                                     7   /*!< EMC EMC_A channel: 7 */
#define BOARD_INITSDRAMPINS_EMC_A7_PIN_NAME                             EMC_A(7)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_A7_LABEL                   "U28[H2]/P1_8-EMC_A7"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_A7_NAME                                 "EMC_A7"   /*!< Identifier name */

/* EMC_A(6) (coord N1), U28[H3]/P1_7-EMC_A6 */
#define BOARD_INITSDRAMPINS_EMC_A6_PERIPHERAL                                EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_A6_SIGNAL                                  EMC_A   /*!< EMC signal: EMC_A */
#define BOARD_INITSDRAMPINS_EMC_A6_CHANNEL                                     6   /*!< EMC EMC_A channel: 6 */
#define BOARD_INITSDRAMPINS_EMC_A6_PIN_NAME                             EMC_A(6)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_A6_LABEL                   "U28[H3]/P1_7-EMC_A6"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_A6_NAME                                 "EMC_A6"   /*!< Identifier name */

/* EMC_A(5) (coord G4), U28[J2]/P1_6-EMC_A5 */
#define BOARD_INITSDRAMPINS_EMC_A5_PERIPHERAL                                EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_A5_SIGNAL                                  EMC_A   /*!< EMC signal: EMC_A */
#define BOARD_INITSDRAMPINS_EMC_A5_CHANNEL                                     5   /*!< EMC EMC_A channel: 5 */
#define BOARD_INITSDRAMPINS_EMC_A5_PIN_NAME                             EMC_A(5)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_A5_LABEL                   "U28[J2]/P1_6-EMC_A5"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_A5_NAME                                 "EMC_A5"   /*!< Identifier name */

/* EMC_A(4) (coord E4), U28[J3]/P1_5-EMC_A4 */
#define BOARD_INITSDRAMPINS_EMC_A4_PERIPHERAL                                EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_A4_SIGNAL                                  EMC_A   /*!< EMC signal: EMC_A */
#define BOARD_INITSDRAMPINS_EMC_A4_CHANNEL                                     4   /*!< EMC EMC_A channel: 4 */
#define BOARD_INITSDRAMPINS_EMC_A4_PIN_NAME                             EMC_A(4)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_A4_LABEL                   "U28[J3]/P1_5-EMC_A4"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_A4_NAME                                 "EMC_A4"   /*!< Identifier name */

/* EMC_A(3) (coord C13), U28[J7]/P0_21-EMC_A3 */
#define BOARD_INITSDRAMPINS_EMC_A3_PERIPHERAL                                EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_A3_SIGNAL                                  EMC_A   /*!< EMC signal: EMC_A */
#define BOARD_INITSDRAMPINS_EMC_A3_CHANNEL                                     3   /*!< EMC EMC_A channel: 3 */
#define BOARD_INITSDRAMPINS_EMC_A3_PIN_NAME                             EMC_A(3)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_A3_LABEL                  "U28[J7]/P0_21-EMC_A3"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_A3_NAME                                 "EMC_A3"   /*!< Identifier name */

/* EMC_A(2) (coord D13), U28[J8]/P0_20-EMC_A2 */
#define BOARD_INITSDRAMPINS_EMC_A2_PERIPHERAL                                EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_A2_SIGNAL                                  EMC_A   /*!< EMC signal: EMC_A */
#define BOARD_INITSDRAMPINS_EMC_A2_CHANNEL                                     2   /*!< EMC EMC_A channel: 2 */
#define BOARD_INITSDRAMPINS_EMC_A2_PIN_NAME                             EMC_A(2)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_A2_LABEL                  "U28[J8]/P0_20-EMC_A2"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_A2_NAME                                 "EMC_A2"   /*!< Identifier name */

/* EMC_A(1) (coord C6), U28[H8]/P0_19-EMC_A1 */
#define BOARD_INITSDRAMPINS_EMC_A1_PERIPHERAL                                EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_A1_SIGNAL                                  EMC_A   /*!< EMC signal: EMC_A */
#define BOARD_INITSDRAMPINS_EMC_A1_CHANNEL                                     1   /*!< EMC EMC_A channel: 1 */
#define BOARD_INITSDRAMPINS_EMC_A1_PIN_NAME                             EMC_A(1)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_A1_LABEL                  "U28[H8]/P0_19-EMC_A1"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_A1_NAME                                 "EMC_A1"   /*!< Identifier name */

/* EMC_A(0) (coord C14), U28[H7]/P0_18-EMC_A0 */
#define BOARD_INITSDRAMPINS_EMC_A0_PERIPHERAL                                EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_A0_SIGNAL                                  EMC_A   /*!< EMC signal: EMC_A */
#define BOARD_INITSDRAMPINS_EMC_A0_CHANNEL                                     0   /*!< EMC EMC_A channel: 0 */
#define BOARD_INITSDRAMPINS_EMC_A0_PIN_NAME                             EMC_A(0)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_A0_LABEL                  "U28[H7]/P0_18-EMC_A0"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_A0_NAME                                 "EMC_A0"   /*!< Identifier name */

