sunklCoin/MCU/board/pin_mux.h
/* EMC_WEN (coord L4), U28[F9]/P0_15-EMC_WEn */
#define BOARD_INITSDRAMPINS_EMC_WEn_PERIPHERAL                               EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_WEn_SIGNAL                                EMC_WE   /*!< EMC signal: EMC_WE */
#define BOARD_INITSDRAMPINS_EMC_WEn_PIN_NAME                             EMC_WEN   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_WEn_LABEL                "U28[F9]/P0_15-EMC_WEn"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_WEn_NAME                               "EMC_WEn"   /*!< Identifier name */

/* EMC_CASN (coord K6), U28[F7]/P1_9-EMC_CASn */
#define BOARD_INITSDRAMPINS_EMC_CASn_PERIPHERAL                              EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_CASn_SIGNAL                              EMC_CAS   /*!< EMC signal: EMC_CAS */
#define BOARD_INITSDRAMPINS_EMC_CASn_PIN_NAME                           EMC_CASN   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_CASn_LABEL               "U28[F7]/P1_9-EMC_CASn"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_CASn_NAME                             "EMC_CASn"   /*!< Identifier name */

/* EMC_RASN (coord N9), U28[F8]/P1_10-EMC_RASn */
#define BOARD_INITSDRAMPINS_EMC_RASn_PERIPHERAL                              EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_RASn_SIGNAL                              EMC_RAS   /*!< EMC signal: EMC_RAS */
#define BOARD_INITSDRAMPINS_EMC_RASn_PIN_NAME                           EMC_RASN   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_RASn_LABEL              "U28[F8]/P1_10-EMC_RASn"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_RASn_NAME                             "EMC_RASn"   /*!< Identifier name */

/* EMC_DYCSN(0) (coord K9), U28[G9]/P1_12-EMC_DYCSn0 */
#define BOARD_INITSDRAMPINS_EMC_DYCSn0_PERIPHERAL                            EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_DYCSn0_SIGNAL                           EMC_DYCS   /*!< EMC signal: EMC_DYCS */
#define BOARD_INITSDRAMPINS_EMC_DYCSn0_CHANNEL                                 0   /*!< EMC EMC_DYCS channel: 0 */
#define BOARD_INITSDRAMPINS_EMC_DYCSn0_PIN_NAME                     EMC_DYCSN(0)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_DYCSn0_LABEL          "U28[G9]/P1_12-EMC_DYCSn0"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_DYCSn0_NAME                         "EMC_DYCSn0"   /*!< Identifier name */

/* EMC_D(15) (coord C5), U28[A2]/RP2[1]/P1_31-EMC_D15 */
#define BOARD_INITSDRAMPINS_EMC_D15_PERIPHERAL                               EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_D15_SIGNAL                                 EMC_D   /*!< EMC signal: EMC_D */
#define BOARD_INITSDRAMPINS_EMC_D15_CHANNEL                                   15   /*!< EMC EMC_D channel: 15 */
#define BOARD_INITSDRAMPINS_EMC_D15_PIN_NAME                           EMC_D(15)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_D15_LABEL         "U28[A2]/RP2[1]/P1_31-EMC_D15"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_D15_NAME                               "EMC_D15"   /*!< Identifier name */

/* EMC_D(14) (coord A8), U28[B1]/RP2[2]/P1_30-EMC_D14 */
#define BOARD_INITSDRAMPINS_EMC_D14_PERIPHERAL                               EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_D14_SIGNAL                                 EMC_D   /*!< EMC signal: EMC_D */
#define BOARD_INITSDRAMPINS_EMC_D14_CHANNEL                                   14   /*!< EMC EMC_D channel: 14 */
#define BOARD_INITSDRAMPINS_EMC_D14_PIN_NAME                           EMC_D(14)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_D14_LABEL         "U28[B1]/RP2[2]/P1_30-EMC_D14"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_D14_NAME                               "EMC_D14"   /*!< Identifier name */

/* EMC_D(13) (coord C11), U28[B2]/RP2[3]/P1_29-EMC_D13 */
#define BOARD_INITSDRAMPINS_EMC_D13_PERIPHERAL                               EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_D13_SIGNAL                                 EMC_D   /*!< EMC signal: EMC_D */
#define BOARD_INITSDRAMPINS_EMC_D13_CHANNEL                                   13   /*!< EMC EMC_D channel: 13 */
#define BOARD_INITSDRAMPINS_EMC_D13_PIN_NAME                           EMC_D(13)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_D13_LABEL         "U28[B2]/RP2[3]/P1_29-EMC_D13"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_D13_NAME                               "EMC_D13"   /*!< Identifier name */

/* EMC_D(12) (coord E12), U28[C1]/RP2[4]/P1_28-EMC_D12 */
#define BOARD_INITSDRAMPINS_EMC_D12_PERIPHERAL                               EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_D12_SIGNAL                                 EMC_D   /*!< EMC signal: EMC_D */
#define BOARD_INITSDRAMPINS_EMC_D12_CHANNEL                                   12   /*!< EMC EMC_D channel: 12 */
#define BOARD_INITSDRAMPINS_EMC_D12_PIN_NAME                           EMC_D(12)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_D12_LABEL         "U28[C1]/RP2[4]/P1_28-EMC_D12"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_D12_NAME                               "EMC_D12"   /*!< Identifier name */

/* EMC_D(11) (coord D4), U28[C2]/RP4[1]/P1_4-EMC_D11 */
#define BOARD_INITSDRAMPINS_EMC_D11_PERIPHERAL                               EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_D11_SIGNAL                                 EMC_D   /*!< EMC signal: EMC_D */
#define BOARD_INITSDRAMPINS_EMC_D11_CHANNEL                                   11   /*!< EMC EMC_D channel: 11 */
#define BOARD_INITSDRAMPINS_EMC_D11_PIN_NAME                           EMC_D(11)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_D11_LABEL          "U28[C2]/RP4[1]/P1_4-EMC_D11"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_D11_NAME                               "EMC_D11"   /*!< Identifier name */

/* EMC_D(10) (coord N8), U28[D1]/RP4[2]/P1_21-EMC_D10 */
#define BOARD_INITSDRAMPINS_EMC_D10_PERIPHERAL                               EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_D10_SIGNAL                                 EMC_D   /*!< EMC signal: EMC_D */
#define BOARD_INITSDRAMPINS_EMC_D10_CHANNEL                                   10   /*!< EMC EMC_D channel: 10 */
#define BOARD_INITSDRAMPINS_EMC_D10_PIN_NAME                           EMC_D(10)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_D10_LABEL         "U28[D1]/RP4[2]/P1_21-EMC_D10"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_D10_NAME                               "EMC_D10"   /*!< Identifier name */

