sunklCoin/MCU/board/pin_mux.h
/* EMC_D(9) (coord M1), U28[D2]/RP4[3]/P1_20-EMC_D9 */
#define BOARD_INITSDRAMPINS_EMC_D9_PERIPHERAL                                EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_D9_SIGNAL                                  EMC_D   /*!< EMC signal: EMC_D */
#define BOARD_INITSDRAMPINS_EMC_D9_CHANNEL                                     9   /*!< EMC EMC_D channel: 9 */
#define BOARD_INITSDRAMPINS_EMC_D9_PIN_NAME                             EMC_D(9)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_D9_LABEL           "U28[D2]/RP4[3]/P1_20-EMC_D9"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_D9_NAME                                 "EMC_D9"   /*!< Identifier name */

/* EMC_D(8) (coord L1), U28[E1]/RP4[4]/P1_19-EMC_D8 */
#define BOARD_INITSDRAMPINS_EMC_D8_PERIPHERAL                                EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_D8_SIGNAL                                  EMC_D   /*!< EMC signal: EMC_D */
#define BOARD_INITSDRAMPINS_EMC_D8_CHANNEL                                     8   /*!< EMC EMC_D channel: 8 */
#define BOARD_INITSDRAMPINS_EMC_D8_PIN_NAME                             EMC_D(8)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_D8_LABEL           "U28[E1]/RP4[4]/P1_19-EMC_D8"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_D8_NAME                                 "EMC_D8"   /*!< Identifier name */

/* EMC_D(7) (coord G12), U28[E9]/RP5[1]/P0_9-EMC_D7 */
#define BOARD_INITSDRAMPINS_EMC_D7_PERIPHERAL                                EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_D7_SIGNAL                                  EMC_D   /*!< EMC signal: EMC_D */
#define BOARD_INITSDRAMPINS_EMC_D7_CHANNEL                                     7   /*!< EMC EMC_D channel: 7 */
#define BOARD_INITSDRAMPINS_EMC_D7_PIN_NAME                             EMC_D(7)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_D7_LABEL            "U28[E9]/RP5[1]/P0_9-EMC_D7"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_D7_NAME                                 "EMC_D7"   /*!< Identifier name */

/* EMC_D(6) (coord H10), U28[D8]/RP5[2]/P0_8-EMC_D6 */
#define BOARD_INITSDRAMPINS_EMC_D6_PERIPHERAL                                EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_D6_SIGNAL                                  EMC_D   /*!< EMC signal: EMC_D */
#define BOARD_INITSDRAMPINS_EMC_D6_CHANNEL                                     6   /*!< EMC EMC_D channel: 6 */
#define BOARD_INITSDRAMPINS_EMC_D6_PIN_NAME                             EMC_D(6)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_D6_LABEL            "U28[D8]/RP5[2]/P0_8-EMC_D6"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_D6_NAME                                 "EMC_D6"   /*!< Identifier name */

/* EMC_D(5) (coord H12), U28[D9]/RP5[3]/P0_7-EMC_D5 */
#define BOARD_INITSDRAMPINS_EMC_D5_PERIPHERAL                                EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_D5_SIGNAL                                  EMC_D   /*!< EMC signal: EMC_D */
#define BOARD_INITSDRAMPINS_EMC_D5_CHANNEL                                     5   /*!< EMC EMC_D channel: 5 */
#define BOARD_INITSDRAMPINS_EMC_D5_PIN_NAME                             EMC_D(5)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_D5_LABEL            "U28[D9]/RP5[3]/P0_7-EMC_D5"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_D5_NAME                                 "EMC_D5"   /*!< Identifier name */

/* EMC_D(4) (coord A5), U28[C8]/RP5[4]/SW2/P0_6-ISP2/P0_6-EMC_D4 */
#define BOARD_INITSDRAMPINS_EMC_D4_PERIPHERAL                                EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_D4_SIGNAL                                  EMC_D   /*!< EMC signal: EMC_D */
#define BOARD_INITSDRAMPINS_EMC_D4_CHANNEL                                     4   /*!< EMC EMC_D channel: 4 */
#define BOARD_INITSDRAMPINS_EMC_D4_PIN_NAME                             EMC_D(4)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_D4_LABEL "U28[C8]/RP5[4]/SW2/P0_6-ISP2/P0_6-EMC_D4" /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_D4_NAME                                 "EMC_D4"   /*!< Identifier name */

/* EMC_D(3) (coord E7), U28[C9]/RP3[1]/JS32[1]/SW3/P0_5-ISP1/P0_5-EMC_D3 */
#define BOARD_INITSDRAMPINS_EMC_D3_PERIPHERAL                                EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_D3_SIGNAL                                  EMC_D   /*!< EMC signal: EMC_D */
#define BOARD_INITSDRAMPINS_EMC_D3_CHANNEL                                     3   /*!< EMC EMC_D channel: 3 */
#define BOARD_INITSDRAMPINS_EMC_D3_PIN_NAME                             EMC_D(3)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_D3_LABEL "U28[C9]/RP3[1]/JS32[1]/SW3/P0_5-ISP1/P0_5-EMC_D3" /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_D3_NAME                                 "EMC_D3"   /*!< Identifier name */

/* EMC_D(2) (coord C8), U28[B8]/RP3[2]/JS32[3]/SW4/P0_4-ISP0/P0_4-EMC_D2 */
#define BOARD_INITSDRAMPINS_EMC_D2_PERIPHERAL                                EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_D2_SIGNAL                                  EMC_D   /*!< EMC signal: EMC_D */
#define BOARD_INITSDRAMPINS_EMC_D2_CHANNEL                                     2   /*!< EMC EMC_D channel: 2 */
#define BOARD_INITSDRAMPINS_EMC_D2_PIN_NAME                             EMC_D(2)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_D2_LABEL "U28[B8]/RP3[2]/JS32[3]/SW4/P0_4-ISP0/P0_4-EMC_D2" /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_D2_NAME                                 "EMC_D2"   /*!< Identifier name */

/* EMC_D(1) (coord A10), U28[B9]/RP3[3]/JS34[1]/U26[11]/J14[2]/P0_3-ISP_FC3_MOSI/P0_3-EMC_D1 */
#define BOARD_INITSDRAMPINS_EMC_D1_PERIPHERAL                                EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_D1_SIGNAL                                  EMC_D   /*!< EMC signal: EMC_D */
#define BOARD_INITSDRAMPINS_EMC_D1_CHANNEL                                     1   /*!< EMC EMC_D channel: 1 */
#define BOARD_INITSDRAMPINS_EMC_D1_PIN_NAME                             EMC_D(1)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_D1_LABEL "U28[B9]/RP3[3]/JS34[1]/U26[11]/J14[2]/P0_3-ISP_FC3_MOSI/P0_3-EMC_D1" /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_D1_NAME                                 "EMC_D1"   /*!< Identifier name */

