sunklCoin/MCU/board/pin_mux.h
/* EMC_D(0) (coord E9), U28[A8]/RP3[4]/JS35[1]/U24[11]/J14[3]/P0_2-ISP_FC3_MISO/P0_2-EMC_D0 */
#define BOARD_INITSDRAMPINS_EMC_D0_PERIPHERAL                                EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_D0_SIGNAL                                  EMC_D   /*!< EMC signal: EMC_D */
#define BOARD_INITSDRAMPINS_EMC_D0_CHANNEL                                     0   /*!< EMC EMC_D channel: 0 */
#define BOARD_INITSDRAMPINS_EMC_D0_PIN_NAME                             EMC_D(0)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_D0_LABEL "U28[A8]/RP3[4]/JS35[1]/U24[11]/J14[3]/P0_2-ISP_FC3_MISO/P0_2-EMC_D0" /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_D0_NAME                                 "EMC_D0"   /*!< Identifier name */

/* EMC_DQM(1) (coord C12), U28[F1]/P1_14-EMC_DQM1 */
#define BOARD_INITSDRAMPINS_EMC_DQM1_PERIPHERAL                              EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_DQM1_SIGNAL                              EMC_DQM   /*!< EMC signal: EMC_DQM */
#define BOARD_INITSDRAMPINS_EMC_DQM1_CHANNEL                                   1   /*!< EMC EMC_DQM channel: 1 */
#define BOARD_INITSDRAMPINS_EMC_DQM1_PIN_NAME                         EMC_DQM(1)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_DQM1_LABEL              "U28[F1]/P1_14-EMC_DQM1"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_DQM1_NAME                             "EMC_DQM1"   /*!< Identifier name */

/* EMC_DQM(0) (coord G10), U28[E8]/P1_13-EMC_DQM0 */
#define BOARD_INITSDRAMPINS_EMC_DQM0_PERIPHERAL                              EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_DQM0_SIGNAL                              EMC_DQM   /*!< EMC signal: EMC_DQM */
#define BOARD_INITSDRAMPINS_EMC_DQM0_CHANNEL                                   0   /*!< EMC EMC_DQM channel: 0 */
#define BOARD_INITSDRAMPINS_EMC_DQM0_PIN_NAME                         EMC_DQM(0)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_DQM0_LABEL              "U28[E8]/P1_13-EMC_DQM0"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_DQM0_NAME                             "EMC_DQM0"   /*!< Identifier name */

/* EMC_CLK(0) (coord B4), U28[F2]/P1_11-EMC_CLK0 */
#define BOARD_INITSDRAMPINS_EMC_CLK0_PERIPHERAL                              EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_CLK0_SIGNAL                              EMC_CLK   /*!< EMC signal: EMC_CLK */
#define BOARD_INITSDRAMPINS_EMC_CLK0_CHANNEL                                   0   /*!< EMC EMC_CLK channel: 0 */
#define BOARD_INITSDRAMPINS_EMC_CLK0_PIN_NAME                         EMC_CLK(0)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_CLK0_LABEL              "U28[F2]/P1_11-EMC_CLK0"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_CLK0_NAME                             "EMC_CLK0"   /*!< Identifier name */

/* EMC_CKE(0) (coord A11), U28[F3]/P1_15-EMC_CKE0 */
#define BOARD_INITSDRAMPINS_EMC_CKE0_PERIPHERAL                              EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_CKE0_SIGNAL                              EMC_CKE   /*!< EMC signal: EMC_CKE */
#define BOARD_INITSDRAMPINS_EMC_CKE0_CHANNEL                                   0   /*!< EMC EMC_CKE channel: 0 */
#define BOARD_INITSDRAMPINS_EMC_CKE0_PIN_NAME                         EMC_CKE(0)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_CKE0_LABEL              "U28[F3]/P1_15-EMC_CKE0"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_CKE0_NAME                             "EMC_CKE0"   /*!< Identifier name */

/* EMC_CKE(1) (coord P11), U28[F3]/P1_22-EMC_CKE1 */
#define BOARD_INITSDRAMPINS_EMC_CKE1_PERIPHERAL                              EMC   /*!< Device name: EMC */
#define BOARD_INITSDRAMPINS_EMC_CKE1_SIGNAL                              EMC_CKE   /*!< EMC signal: EMC_CKE */
#define BOARD_INITSDRAMPINS_EMC_CKE1_CHANNEL                                   1   /*!< EMC EMC_CKE channel: 1 */
#define BOARD_INITSDRAMPINS_EMC_CKE1_PIN_NAME                         EMC_CKE(1)   /*!< Pin name */
#define BOARD_INITSDRAMPINS_EMC_CKE1_LABEL              "U28[F3]/P1_22-EMC_CKE1"   /*!< Label */
#define BOARD_INITSDRAMPINS_EMC_CKE1_NAME                             "EMC_CKE1"   /*!< Identifier name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDRAMPins(void); /* Function assigned for the Cortex-M4F */

/* USB1_DP (coord H3), J2[3]/U2[2]/U25[H3]/USB1_DP_TRGT */
#define BOARD_INITUSBPINS_USB1_DP_PERIPHERAL                              USBHSH   /*!< Device name: USBHSH */
#define BOARD_INITUSBPINS_USB1_DP_SIGNAL                                  USB_DP   /*!< USBHSH signal: USB_DP */
#define BOARD_INITUSBPINS_USB1_DP_PIN_NAME                               USB1_DP   /*!< Pin name */
#define BOARD_INITUSBPINS_USB1_DP_LABEL       "J2[3]/U2[2]/U25[H3]/USB1_DP_TRGT"   /*!< Label */
#define BOARD_INITUSBPINS_USB1_DP_NAME                                 "USB1_DP"   /*!< Identifier name */

/* USB1_DM (coord H2), J2[2]/U2[3]/U25[H2]/USB1_DM_TRGT */
#define BOARD_INITUSBPINS_USB1_DM_PERIPHERAL                              USBHSH   /*!< Device name: USBHSH */
#define BOARD_INITUSBPINS_USB1_DM_SIGNAL                                  USB_DM   /*!< USBHSH signal: USB_DM */
#define BOARD_INITUSBPINS_USB1_DM_PIN_NAME                               USB1_DM   /*!< Pin name */
#define BOARD_INITUSBPINS_USB1_DM_LABEL       "J2[2]/U2[3]/U25[H2]/USB1_DM_TRGT"   /*!< Label */
#define BOARD_INITUSBPINS_USB1_DM_NAME                                 "USB1_DM"   /*!< Identifier name */

/* USB1_VBUS (coord G2), J2[1]/U2[4]/VBUS1_TARGET */
#define BOARD_INITUSBPINS_USB1_VBUS_PERIPHERAL                            USBHSH   /*!< Device name: USBHSH */
#define BOARD_INITUSBPINS_USB1_VBUS_SIGNAL                              USB_VBUS   /*!< USBHSH signal: USB_VBUS */
#define BOARD_INITUSBPINS_USB1_VBUS_PIN_NAME                           USB1_VBUS   /*!< Pin name */
#define BOARD_INITUSBPINS_USB1_VBUS_LABEL             "J2[1]/U2[4]/VBUS1_TARGET"   /*!< Label */
#define BOARD_INITUSBPINS_USB1_VBUS_NAME                             "USB1_VBUS"   /*!< Identifier name */

/* USB1_ID (coord G1), J2[4]/USB1_ID_TARGET */
#define BOARD_INITUSBPINS_USB1_ID_PERIPHERAL                              USBHSH   /*!< Device name: USBHSH */
#define BOARD_INITUSBPINS_USB1_ID_SIGNAL                             USB_IDVALUE   /*!< USBHSH signal: USB_IDVALUE */
#define BOARD_INITUSBPINS_USB1_ID_PIN_NAME                               USB1_ID   /*!< Pin name */
#define BOARD_INITUSBPINS_USB1_ID_LABEL                   "J2[4]/USB1_ID_TARGET"   /*!< Label */
#define BOARD_INITUSBPINS_USB1_ID_NAME                                 "USB1_ID"   /*!< Identifier name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSBPins(void); /* Function assigned for the Cortex-M4F */

/* SWDIO (coord M3), P1[2]/U22[4]/D5[5]/IF_SWDIO */
#define BOARD_INITSWDPINS_IF_SWDIO_PERIPHERAL                                SWD   /*!< Device name: SWD */
#define BOARD_INITSWDPINS_IF_SWDIO_SIGNAL                                  SWDIO   /*!< SWD signal: SWDIO */
#define BOARD_INITSWDPINS_IF_SWDIO_PIN_NAME                                SWDIO   /*!< Pin name */
#define BOARD_INITSWDPINS_IF_SWDIO_LABEL           "P1[2]/U22[4]/D5[5]/IF_SWDIO"   /*!< Label */
#define BOARD_INITSWDPINS_IF_SWDIO_NAME                               "IF_SWDIO"   /*!< Identifier name */

/* SWCLK (coord L3), U16[4]/SWDCLK_TRGT */
#define BOARD_INITSWDPINS_SWDCLK_TRGT_PERIPHERAL                             SWD   /*!< Device name: SWD */
#define BOARD_INITSWDPINS_SWDCLK_TRGT_SIGNAL                               SWCLK   /*!< SWD signal: SWCLK */
#define BOARD_INITSWDPINS_SWDCLK_TRGT_PIN_NAME                             SWCLK   /*!< Pin name */
#define BOARD_INITSWDPINS_SWDCLK_TRGT_LABEL                 "U16[4]/SWDCLK_TRGT"   /*!< Label */
#define BOARD_INITSWDPINS_SWDCLK_TRGT_NAME                         "SWDCLK_TRGT"   /*!< Identifier name */

/* SWO (coord P2), Battery Temperature detect */
#define BOARD_INITSWDPINS_SWO_TRGT_PERIPHERAL                                SWD   /*!< Device name: SWD */
#define BOARD_INITSWDPINS_SWO_TRGT_SIGNAL                                    SWO   /*!< SWD signal: SWO */
#define BOARD_INITSWDPINS_SWO_TRGT_PIN_NAME                                  SWO   /*!< Pin name */
#define BOARD_INITSWDPINS_SWO_TRGT_LABEL            "Battery Temperature detect"   /*!< Label */
#define BOARD_INITSWDPINS_SWO_TRGT_NAME                               "SWO_TRGT"   /*!< Identifier name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSWDPins(void); /* Function assigned for the Cortex-M4F */

/* LCD_PWR (coord K3), J16[31]/P2_11-LCD_PWR */
#define BOARD_INITLCDPINS_LCD_PWR_PERIPHERAL                                 LCD   /*!< Device name: LCD */
#define BOARD_INITLCDPINS_LCD_PWR_SIGNAL                                 LCD_PWR   /*!< LCD signal: LCD_PWR */
#define BOARD_INITLCDPINS_LCD_PWR_PIN_NAME                               LCD_PWR   /*!< Pin name */
#define BOARD_INITLCDPINS_LCD_PWR_LABEL                  "J16[31]/P2_11-LCD_PWR"   /*!< Label */
#define BOARD_INITLCDPINS_LCD_PWR_NAME                                 "LCD_PWR"   /*!< Identifier name */

/* LCD_FP (coord L7), J16[33]/P2_14-LCD_FP */
#define BOARD_INITLCDPINS_LCD_FP_PERIPHERAL                                  LCD   /*!< Device name: LCD */
#define BOARD_INITLCDPINS_LCD_FP_SIGNAL                                   LCD_FP   /*!< LCD signal: LCD_FP */
#define BOARD_INITLCDPINS_LCD_FP_PIN_NAME                                 LCD_FP   /*!< Pin name */
#define BOARD_INITLCDPINS_LCD_FP_LABEL                    "J16[33]/P2_14-LCD_FP"   /*!< Label */
#define BOARD_INITLCDPINS_LCD_FP_NAME                                   "LCD_FP"   /*!< Identifier name */

/* LCD_DCLK (coord P7), J16[30]/P2_13-LCD_DCLK */
#define BOARD_INITLCDPINS_LCD_DCLK_PERIPHERAL                                LCD   /*!< Device name: LCD */
#define BOARD_INITLCDPINS_LCD_DCLK_SIGNAL                               LCD_DCLK   /*!< LCD signal: LCD_DCLK */
#define BOARD_INITLCDPINS_LCD_DCLK_PIN_NAME                             LCD_DCLK   /*!< Pin name */
#define BOARD_INITLCDPINS_LCD_DCLK_LABEL                "J16[30]/P2_13-LCD_DCLK"   /*!< Label */
#define BOARD_INITLCDPINS_LCD_DCLK_NAME                               "LCD_DCLK"   /*!< Identifier name */

