sunklCoin/MCU/board/pin_mux.h
/* LCD_LP (coord L8), J16[32]/P2_16-LCD_LP */
#define BOARD_INITLCDPINS_LCD_LP_PERIPHERAL                                  LCD   /*!< Device name: LCD */
#define BOARD_INITLCDPINS_LCD_LP_SIGNAL                                   LCD_LP   /*!< LCD signal: LCD_LP */
#define BOARD_INITLCDPINS_LCD_LP_PIN_NAME                                 LCD_LP   /*!< Pin name */
#define BOARD_INITLCDPINS_LCD_LP_LABEL                    "J16[32]/P2_16-LCD_LP"   /*!< Label */
#define BOARD_INITLCDPINS_LCD_LP_NAME                                   "LCD_LP"   /*!< Identifier name */

/* LCD_AC (coord M8), J16[34]/P2_15-LCD_AC_ENAB_M */
#define BOARD_INITLCDPINS_LCD_AC_ENAB_M_PERIPHERAL                           LCD   /*!< Device name: LCD */
#define BOARD_INITLCDPINS_LCD_AC_ENAB_M_SIGNAL                            LCD_AC   /*!< LCD signal: LCD_AC */
#define BOARD_INITLCDPINS_LCD_AC_ENAB_M_PIN_NAME                          LCD_AC   /*!< Pin name */
#define BOARD_INITLCDPINS_LCD_AC_ENAB_M_LABEL      "J16[34]/P2_15-LCD_AC_ENAB_M"   /*!< Label */
#define BOARD_INITLCDPINS_LCD_AC_ENAB_M_NAME                     "LCD_AC_ENAB_M"   /*!< Identifier name */

/* LCD_VD(4) (coord K10), J16[9]/P2_22-LCD_VD4 */
#define BOARD_INITLCDPINS_LCD_VD4_PERIPHERAL                                 LCD   /*!< Device name: LCD */
#define BOARD_INITLCDPINS_LCD_VD4_SIGNAL                                  LCD_VD   /*!< LCD signal: LCD_VD */
#define BOARD_INITLCDPINS_LCD_VD4_CHANNEL                                      4   /*!< LCD LCD_VD channel: 4 */
#define BOARD_INITLCDPINS_LCD_VD4_PIN_NAME                             LCD_VD(4)   /*!< Pin name */
#define BOARD_INITLCDPINS_LCD_VD4_LABEL                   "J16[9]/P2_22-LCD_VD4"   /*!< Label */
#define BOARD_INITLCDPINS_LCD_VD4_NAME                                 "LCD_VD4"   /*!< Identifier name */

/* LCD_VD(3) (coord L10), J16[8]/P2_21-LCD_VD3 */
#define BOARD_INITLCDPINS_LCD_VD3_PERIPHERAL                                 LCD   /*!< Device name: LCD */
#define BOARD_INITLCDPINS_LCD_VD3_SIGNAL                                  LCD_VD   /*!< LCD signal: LCD_VD */
#define BOARD_INITLCDPINS_LCD_VD3_CHANNEL                                      3   /*!< LCD LCD_VD channel: 3 */
#define BOARD_INITLCDPINS_LCD_VD3_PIN_NAME                             LCD_VD(3)   /*!< Pin name */
#define BOARD_INITLCDPINS_LCD_VD3_LABEL                   "J16[8]/P2_21-LCD_VD3"   /*!< Label */
#define BOARD_INITLCDPINS_LCD_VD3_NAME                                 "LCD_VD3"   /*!< Identifier name */

/* LCD_VD(11) (coord G11), J16[16]/P2_29-LCD_VD11 */
#define BOARD_INITLCDPINS_LCD_VD11_PERIPHERAL                                LCD   /*!< Device name: LCD */
#define BOARD_INITLCDPINS_LCD_VD11_SIGNAL                                 LCD_VD   /*!< LCD signal: LCD_VD */
#define BOARD_INITLCDPINS_LCD_VD11_CHANNEL                                    11   /*!< LCD LCD_VD channel: 11 */
#define BOARD_INITLCDPINS_LCD_VD11_PIN_NAME                           LCD_VD(11)   /*!< Pin name */
#define BOARD_INITLCDPINS_LCD_VD11_LABEL                "J16[16]/P2_29-LCD_VD11"   /*!< Label */
#define BOARD_INITLCDPINS_LCD_VD11_NAME                               "LCD_VD11"   /*!< Identifier name */

/* LCD_VD(7) (coord J11), J16[12]/P2_25-LCD_VD7 */
#define BOARD_INITLCDPINS_LCD_VD7_PERIPHERAL                                 LCD   /*!< Device name: LCD */
#define BOARD_INITLCDPINS_LCD_VD7_SIGNAL                                  LCD_VD   /*!< LCD signal: LCD_VD */
#define BOARD_INITLCDPINS_LCD_VD7_CHANNEL                                      7   /*!< LCD LCD_VD channel: 7 */
#define BOARD_INITLCDPINS_LCD_VD7_PIN_NAME                             LCD_VD(7)   /*!< Pin name */
#define BOARD_INITLCDPINS_LCD_VD7_LABEL                  "J16[12]/P2_25-LCD_VD7"   /*!< Label */
#define BOARD_INITLCDPINS_LCD_VD7_NAME                                 "LCD_VD7"   /*!< Identifier name */

/* LCD_VD(12) (coord F12), J16[17]/P2_30-LCD_VD12 */
#define BOARD_INITLCDPINS_LCD_VD12_PERIPHERAL                                LCD   /*!< Device name: LCD */
#define BOARD_INITLCDPINS_LCD_VD12_SIGNAL                                 LCD_VD   /*!< LCD signal: LCD_VD */
#define BOARD_INITLCDPINS_LCD_VD12_CHANNEL                                    12   /*!< LCD LCD_VD channel: 12 */
#define BOARD_INITLCDPINS_LCD_VD12_PIN_NAME                           LCD_VD(12)   /*!< Pin name */
#define BOARD_INITLCDPINS_LCD_VD12_LABEL                "J16[17]/P2_30-LCD_VD12"   /*!< Label */
#define BOARD_INITLCDPINS_LCD_VD12_NAME                               "LCD_VD12"   /*!< Identifier name */

/* LCD_VD(10) (coord G13), J16[15]/P2_28-LCD_VD10 */
#define BOARD_INITLCDPINS_LCD_VD10_PERIPHERAL                                LCD   /*!< Device name: LCD */
#define BOARD_INITLCDPINS_LCD_VD10_SIGNAL                                 LCD_VD   /*!< LCD signal: LCD_VD */
#define BOARD_INITLCDPINS_LCD_VD10_CHANNEL                                    10   /*!< LCD LCD_VD channel: 10 */
#define BOARD_INITLCDPINS_LCD_VD10_PIN_NAME                           LCD_VD(10)   /*!< Pin name */
#define BOARD_INITLCDPINS_LCD_VD10_LABEL                "J16[15]/P2_28-LCD_VD10"   /*!< Label */
#define BOARD_INITLCDPINS_LCD_VD10_NAME                               "LCD_VD10"   /*!< Identifier name */

/* LCD_VD(13) (coord D14), J16[18]/P2_31-LCD_VD13 */
#define BOARD_INITLCDPINS_LCD_VD13_PERIPHERAL                                LCD   /*!< Device name: LCD */
#define BOARD_INITLCDPINS_LCD_VD13_SIGNAL                                 LCD_VD   /*!< LCD signal: LCD_VD */
#define BOARD_INITLCDPINS_LCD_VD13_CHANNEL                                    13   /*!< LCD LCD_VD channel: 13 */
#define BOARD_INITLCDPINS_LCD_VD13_PIN_NAME                           LCD_VD(13)   /*!< Pin name */
#define BOARD_INITLCDPINS_LCD_VD13_LABEL                "J16[18]/P2_31-LCD_VD13"   /*!< Label */
#define BOARD_INITLCDPINS_LCD_VD13_NAME                               "LCD_VD13"   /*!< Identifier name */

/* LCD_VD(6) (coord K14), J16[11]/P2_24-LCD_VD6 */
#define BOARD_INITLCDPINS_LCD_VD6_PERIPHERAL                                 LCD   /*!< Device name: LCD */
#define BOARD_INITLCDPINS_LCD_VD6_SIGNAL                                  LCD_VD   /*!< LCD signal: LCD_VD */
#define BOARD_INITLCDPINS_LCD_VD6_CHANNEL                                      6   /*!< LCD LCD_VD channel: 6 */
#define BOARD_INITLCDPINS_LCD_VD6_PIN_NAME                             LCD_VD(6)   /*!< Pin name */
#define BOARD_INITLCDPINS_LCD_VD6_LABEL                  "J16[11]/P2_24-LCD_VD6"   /*!< Label */
#define BOARD_INITLCDPINS_LCD_VD6_NAME                                 "LCD_VD6"   /*!< Identifier name */

/* LCD_VD(5) (coord M14), J16[10]/P2_23-LCD_VD5 */
#define BOARD_INITLCDPINS_LCD_VD5_PERIPHERAL                                 LCD   /*!< Device name: LCD */
#define BOARD_INITLCDPINS_LCD_VD5_SIGNAL                                  LCD_VD   /*!< LCD signal: LCD_VD */
#define BOARD_INITLCDPINS_LCD_VD5_CHANNEL                                      5   /*!< LCD LCD_VD channel: 5 */
#define BOARD_INITLCDPINS_LCD_VD5_PIN_NAME                             LCD_VD(5)   /*!< Pin name */
#define BOARD_INITLCDPINS_LCD_VD5_LABEL                  "J16[10]/P2_23-LCD_VD5"   /*!< Label */
#define BOARD_INITLCDPINS_LCD_VD5_NAME                                 "LCD_VD5"   /*!< Identifier name */

/* LCD_VD(14) (coord D12), J16[19]/JS36[1]/P3_0-LCD_VD14 */
#define BOARD_INITLCDPINS_LCD_VD14_PERIPHERAL                                LCD   /*!< Device name: LCD */
#define BOARD_INITLCDPINS_LCD_VD14_SIGNAL                                 LCD_VD   /*!< LCD signal: LCD_VD */
#define BOARD_INITLCDPINS_LCD_VD14_CHANNEL                                    14   /*!< LCD LCD_VD channel: 14 */
#define BOARD_INITLCDPINS_LCD_VD14_PIN_NAME                           LCD_VD(14)   /*!< Pin name */
#define BOARD_INITLCDPINS_LCD_VD14_LABEL         "J16[19]/JS36[1]/P3_0-LCD_VD14"   /*!< Label */
#define BOARD_INITLCDPINS_LCD_VD14_NAME                               "LCD_VD14"   /*!< Identifier name */

/* LCD_VD(15) (coord D11), J16[20]/JS33[1]/P3_1-LCD_VD15 */
#define BOARD_INITLCDPINS_LCD_VD15_PERIPHERAL                                LCD   /*!< Device name: LCD */
#define BOARD_INITLCDPINS_LCD_VD15_SIGNAL                                 LCD_VD   /*!< LCD signal: LCD_VD */
#define BOARD_INITLCDPINS_LCD_VD15_CHANNEL                                    15   /*!< LCD LCD_VD channel: 15 */
#define BOARD_INITLCDPINS_LCD_VD15_PIN_NAME                           LCD_VD(15)   /*!< Pin name */
#define BOARD_INITLCDPINS_LCD_VD15_LABEL         "J16[20]/JS33[1]/P3_1-LCD_VD15"   /*!< Label */
#define BOARD_INITLCDPINS_LCD_VD15_NAME                               "LCD_VD15"   /*!< Identifier name */

