sunklCoin/MCU/board/pin_mux.h
/* LCD_VD(19) (coord B10), J16[24]/P3_5-LCD_VD19 */
#define BOARD_INITLCDPINS_LCD_VD19_PERIPHERAL                                LCD   /*!< Device name: LCD */
#define BOARD_INITLCDPINS_LCD_VD19_SIGNAL                                 LCD_VD   /*!< LCD signal: LCD_VD */
#define BOARD_INITLCDPINS_LCD_VD19_CHANNEL                                    19   /*!< LCD LCD_VD channel: 19 */
#define BOARD_INITLCDPINS_LCD_VD19_PIN_NAME                           LCD_VD(19)   /*!< Pin name */
#define BOARD_INITLCDPINS_LCD_VD19_LABEL                 "J16[24]/P3_5-LCD_VD19"   /*!< Label */
#define BOARD_INITLCDPINS_LCD_VD19_NAME                               "LCD_VD19"   /*!< Identifier name */

/* LCD_VD(20) (coord C9), J16[25]/P3_6-LCD_VD20 */
#define BOARD_INITLCDPINS_LCD_VD20_PERIPHERAL                                LCD   /*!< Device name: LCD */
#define BOARD_INITLCDPINS_LCD_VD20_SIGNAL                                 LCD_VD   /*!< LCD signal: LCD_VD */
#define BOARD_INITLCDPINS_LCD_VD20_CHANNEL                                    20   /*!< LCD LCD_VD channel: 20 */
#define BOARD_INITLCDPINS_LCD_VD20_PIN_NAME                           LCD_VD(20)   /*!< Pin name */
#define BOARD_INITLCDPINS_LCD_VD20_LABEL                 "J16[25]/P3_6-LCD_VD20"   /*!< Label */
#define BOARD_INITLCDPINS_LCD_VD20_NAME                               "LCD_VD20"   /*!< Identifier name */

/* LCD_VD(21) (coord B8), J16[26]/P3_7-LCD_VD21 */
#define BOARD_INITLCDPINS_LCD_VD21_PERIPHERAL                                LCD   /*!< Device name: LCD */
#define BOARD_INITLCDPINS_LCD_VD21_SIGNAL                                 LCD_VD   /*!< LCD signal: LCD_VD */
#define BOARD_INITLCDPINS_LCD_VD21_CHANNEL                                    21   /*!< LCD LCD_VD channel: 21 */
#define BOARD_INITLCDPINS_LCD_VD21_PIN_NAME                           LCD_VD(21)   /*!< Pin name */
#define BOARD_INITLCDPINS_LCD_VD21_LABEL                 "J16[26]/P3_7-LCD_VD21"   /*!< Label */
#define BOARD_INITLCDPINS_LCD_VD21_NAME                               "LCD_VD21"   /*!< Identifier name */

/* LCD_VD(22) (coord A7), J16[27]/P3_8-LCD_VD22 */
#define BOARD_INITLCDPINS_LCD_VD22_PERIPHERAL                                LCD   /*!< Device name: LCD */
#define BOARD_INITLCDPINS_LCD_VD22_SIGNAL                                 LCD_VD   /*!< LCD signal: LCD_VD */
#define BOARD_INITLCDPINS_LCD_VD22_CHANNEL                                    22   /*!< LCD LCD_VD channel: 22 */
#define BOARD_INITLCDPINS_LCD_VD22_PIN_NAME                           LCD_VD(22)   /*!< Pin name */
#define BOARD_INITLCDPINS_LCD_VD22_LABEL                 "J16[27]/P3_8-LCD_VD22"   /*!< Label */
#define BOARD_INITLCDPINS_LCD_VD22_NAME                               "LCD_VD22"   /*!< Identifier name */

/* LCD_VD(23) (coord C7), J16[28]/P3_9-LCD_VD23 */
#define BOARD_INITLCDPINS_LCD_VD23_PERIPHERAL                                LCD   /*!< Device name: LCD */
#define BOARD_INITLCDPINS_LCD_VD23_SIGNAL                                 LCD_VD   /*!< LCD signal: LCD_VD */
#define BOARD_INITLCDPINS_LCD_VD23_CHANNEL                                    23   /*!< LCD LCD_VD channel: 23 */
#define BOARD_INITLCDPINS_LCD_VD23_PIN_NAME                           LCD_VD(23)   /*!< Pin name */
#define BOARD_INITLCDPINS_LCD_VD23_LABEL                 "J16[28]/P3_9-LCD_VD23"   /*!< Label */
#define BOARD_INITLCDPINS_LCD_VD23_NAME                               "LCD_VD23"   /*!< Identifier name */

/* PIO3_3 (coord A13), LCD WR pin */
#define BOARD_INITLCDPINS_LCD_WR_GPIO                                       GPIO   /*!< GPIO device name: GPIO */
#define BOARD_INITLCDPINS_LCD_WR_PORT                                         3U   /*!< PORT device index: 3 */
#define BOARD_INITLCDPINS_LCD_WR_GPIO_PIN                                     3U   /*!< PIO3 pin index: 3 */
#define BOARD_INITLCDPINS_LCD_WR_PIN_NAME                                 PIO3_3   /*!< Pin name */
#define BOARD_INITLCDPINS_LCD_WR_LABEL                              "LCD WR pin"   /*!< Label */
#define BOARD_INITLCDPINS_LCD_WR_NAME                                   "LCD_WR"   /*!< Identifier name */

/* FC9_SCK (coord N2), LCD SPI clock pin */
#define BOARD_INITLCDPINS_LCD_SPI_CLK_PERIPHERAL                       FLEXCOMM9   /*!< Device name: FLEXCOMM9 */
#define BOARD_INITLCDPINS_LCD_SPI_CLK_SIGNAL                                 SCK   /*!< FLEXCOMM9 signal: SCK */
#define BOARD_INITLCDPINS_LCD_SPI_CLK_PIN_NAME                           FC9_SCK   /*!< Pin name */
#define BOARD_INITLCDPINS_LCD_SPI_CLK_LABEL                  "LCD SPI clock pin"   /*!< Label */
#define BOARD_INITLCDPINS_LCD_SPI_CLK_NAME                         "LCD_SPI_CLK"   /*!< Identifier name */

/* FC9_RXD_SDA_MOSI (coord P5), LCD SPI MOSI pin */
#define BOARD_INITLCDPINS_LCD_SPI_MOSI_PERIPHERAL                      FLEXCOMM9   /*!< Device name: FLEXCOMM9 */
#define BOARD_INITLCDPINS_LCD_SPI_MOSI_SIGNAL                       RXD_SDA_MOSI   /*!< FLEXCOMM9 signal: RXD_SDA_MOSI */
#define BOARD_INITLCDPINS_LCD_SPI_MOSI_PIN_NAME                 FC9_RXD_SDA_MOSI   /*!< Pin name */
#define BOARD_INITLCDPINS_LCD_SPI_MOSI_LABEL                  "LCD SPI MOSI pin"   /*!< Label */
#define BOARD_INITLCDPINS_LCD_SPI_MOSI_NAME                       "LCD_SPI_MOSI"   /*!< Identifier name */

/* FC9_TXD_SCL_MISO (coord N5), LCD SPI MISO pin */
#define BOARD_INITLCDPINS_LCD_SPI_MISO_PERIPHERAL                      FLEXCOMM9   /*!< Device name: FLEXCOMM9 */
#define BOARD_INITLCDPINS_LCD_SPI_MISO_SIGNAL                       TXD_SCL_MISO   /*!< FLEXCOMM9 signal: TXD_SCL_MISO */
#define BOARD_INITLCDPINS_LCD_SPI_MISO_PIN_NAME                 FC9_TXD_SCL_MISO   /*!< Pin name */
#define BOARD_INITLCDPINS_LCD_SPI_MISO_LABEL                  "LCD SPI MISO pin"   /*!< Label */
#define BOARD_INITLCDPINS_LCD_SPI_MISO_NAME                       "LCD_SPI_MISO"   /*!< Identifier name */

/* FC9_CTS_SDA_SSEL0 (coord K13), LCD SPI CS pin */
#define BOARD_INITLCDPINS_LCD_SPI_CS_PERIPHERAL                        FLEXCOMM9   /*!< Device name: FLEXCOMM9 */
#define BOARD_INITLCDPINS_LCD_SPI_CS_SIGNAL                        CTS_SDA_SSEL0   /*!< FLEXCOMM9 signal: CTS_SDA_SSEL0 */
#define BOARD_INITLCDPINS_LCD_SPI_CS_PIN_NAME                  FC9_CTS_SDA_SSEL0   /*!< Pin name */
#define BOARD_INITLCDPINS_LCD_SPI_CS_LABEL                      "LCD SPI CS pin"   /*!< Label */
#define BOARD_INITLCDPINS_LCD_SPI_CS_NAME                           "LCD_SPI_CS"   /*!< Identifier name */

/* PIO4_16 (coord C4), LCD reset pin */
#define BOARD_INITLCDPINS_LCD_RST_GPIO                                      GPIO   /*!< GPIO device name: GPIO */
#define BOARD_INITLCDPINS_LCD_RST_PORT                                        4U   /*!< PORT device index: 4 */
#define BOARD_INITLCDPINS_LCD_RST_GPIO_PIN                                   16U   /*!< PIO4 pin index: 16 */
#define BOARD_INITLCDPINS_LCD_RST_PIN_NAME                               PIO4_16   /*!< Pin name */
#define BOARD_INITLCDPINS_LCD_RST_LABEL                          "LCD reset pin"   /*!< Label */
#define BOARD_INITLCDPINS_LCD_RST_NAME                                 "LCD_RST"   /*!< Identifier name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLCDPins(void); /* Function assigned for the Cortex-M4F */

/* PDM1_CLK (coord L14), J13[18]/JS25[3]/DMIC1[4]/P1_2-PDM1_CLK */
#define BOARD_INITAUDIOPINS_PDM1_CLK_PERIPHERAL                            DMIC0   /*!< Device name: DMIC0 */
#define BOARD_INITAUDIOPINS_PDM1_CLK_SIGNAL                                  CLK   /*!< DMIC0 signal: CLK */
#define BOARD_INITAUDIOPINS_PDM1_CLK_CHANNEL                                   1   /*!< DMIC0 CLK channel: 1 */
#define BOARD_INITAUDIOPINS_PDM1_CLK_PIN_NAME                           PDM1_CLK   /*!< Pin name */
#define BOARD_INITAUDIOPINS_PDM1_CLK_LABEL "J13[18]/JS25[3]/DMIC1[4]/P1_2-PDM1_CLK" /*!< Label */
#define BOARD_INITAUDIOPINS_PDM1_CLK_NAME                             "PDM1_CLK"   /*!< Identifier name */

/* PDM1_DATA (coord J13), JS26[3]/DMIC1[1]/P1_3-PDM1_DATA */
#define BOARD_INITAUDIOPINS_PDM1_DATA_PERIPHERAL                           DMIC0   /*!< Device name: DMIC0 */
#define BOARD_INITAUDIOPINS_PDM1_DATA_SIGNAL                                DATA   /*!< DMIC0 signal: DATA */
#define BOARD_INITAUDIOPINS_PDM1_DATA_CHANNEL                                  1   /*!< DMIC0 DATA channel: 1 */
#define BOARD_INITAUDIOPINS_PDM1_DATA_PIN_NAME                         PDM1_DATA   /*!< Pin name */
#define BOARD_INITAUDIOPINS_PDM1_DATA_LABEL    "JS26[3]/DMIC1[1]/P1_3-PDM1_DATA"   /*!< Label */
#define BOARD_INITAUDIOPINS_PDM1_DATA_NAME                           "PDM1_DATA"   /*!< Identifier name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitAudioPins(void); /* Function assigned for the Cortex-M4F */

/* SCT0_GPI0 (coord D6), IR PMW */
#define BOARD_INITIRDAPINS_ISP_FC3_SCK_PERIPHERAL                           SCT0   /*!< Device name: SCT0 */
#define BOARD_INITIRDAPINS_ISP_FC3_SCK_SIGNAL                                 IN   /*!< SCT0 signal: IN */
#define BOARD_INITIRDAPINS_ISP_FC3_SCK_CHANNEL                                 0   /*!< SCT0 IN channel: 0 */
#define BOARD_INITIRDAPINS_ISP_FC3_SCK_PIN_NAME                        SCT0_GPI0   /*!< Pin name */
#define BOARD_INITIRDAPINS_ISP_FC3_SCK_LABEL                            "IR PMW"   /*!< Label */
#define BOARD_INITIRDAPINS_ISP_FC3_SCK_NAME                        "ISP_FC3_SCK"   /*!< Identifier name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitIrDAPins(void); /* Function assigned for the Cortex-M4F */

/* PIO0_1 (coord A1), Power key */
#define BOARD_INITKEYBOARDPINS_PWR_KEY_GPIO                                 GPIO   /*!< GPIO device name: GPIO */
#define BOARD_INITKEYBOARDPINS_PWR_KEY_PORT                                   0U   /*!< PORT device index: 0 */
#define BOARD_INITKEYBOARDPINS_PWR_KEY_GPIO_PIN                               1U   /*!< PIO0 pin index: 1 */
#define BOARD_INITKEYBOARDPINS_PWR_KEY_PIN_NAME                           PIO0_1   /*!< Pin name */
#define BOARD_INITKEYBOARDPINS_PWR_KEY_LABEL                         "Power key"   /*!< Label */
#define BOARD_INITKEYBOARDPINS_PWR_KEY_NAME                            "PWR_KEY"   /*!< Identifier name */

/* PIO0_22 (coord B12), Keyboard int pin */
#define BOARD_INITKEYBOARDPINS_KB_INT_GPIO                                  GPIO   /*!< GPIO device name: GPIO */
#define BOARD_INITKEYBOARDPINS_KB_INT_PORT                                    0U   /*!< PORT device index: 0 */
#define BOARD_INITKEYBOARDPINS_KB_INT_GPIO_PIN                               22U   /*!< PIO0 pin index: 22 */
#define BOARD_INITKEYBOARDPINS_KB_INT_PIN_NAME                           PIO0_22   /*!< Pin name */
#define BOARD_INITKEYBOARDPINS_KB_INT_LABEL                   "Keyboard int pin"   /*!< Label */
#define BOARD_INITKEYBOARDPINS_KB_INT_NAME                              "KB_INT"   /*!< Identifier name */

/* PIO3_11 (coord B2), Keyboard reset pin */
#define BOARD_INITKEYBOARDPINS_KB_RST_GPIO                                  GPIO   /*!< GPIO device name: GPIO */
#define BOARD_INITKEYBOARDPINS_KB_RST_PORT                                    3U   /*!< PORT device index: 3 */
#define BOARD_INITKEYBOARDPINS_KB_RST_GPIO_PIN                               11U   /*!< PIO3 pin index: 11 */
#define BOARD_INITKEYBOARDPINS_KB_RST_PIN_NAME                           PIO3_11   /*!< Pin name */
#define BOARD_INITKEYBOARDPINS_KB_RST_LABEL                 "Keyboard reset pin"   /*!< Label */
#define BOARD_INITKEYBOARDPINS_KB_RST_NAME                              "KB_RST"   /*!< Identifier name */

