sunklCoin/MCU/board/pin_mux.h
/* FC6_RXD_SDA_MOSI_DATA (coord F14), U10[32]/J9[10]/P4_2-FC6_I2S_TX_DATA */
#define BOARD_INITKEYBOARDPINS_FC6_I2S_TX_DATA_PERIPHERAL              FLEXCOMM6   /*!< Device name: FLEXCOMM6 */
#define BOARD_INITKEYBOARDPINS_FC6_I2S_TX_DATA_SIGNAL          RXD_SDA_MOSI_DATA   /*!< FLEXCOMM6 signal: RXD_SDA_MOSI_DATA */
#define BOARD_INITKEYBOARDPINS_FC6_I2S_TX_DATA_PIN_NAME    FC6_RXD_SDA_MOSI_DATA   /*!< Pin name */
#define BOARD_INITKEYBOARDPINS_FC6_I2S_TX_DATA_LABEL "U10[32]/J9[10]/P4_2-FC6_I2S_TX_DATA" /*!< Label */
#define BOARD_INITKEYBOARDPINS_FC6_I2S_TX_DATA_NAME            "FC6_I2S_TX_DATA"   /*!< Identifier name */

/* FC6_TXD_SCL_MISO_WS (coord F13), U10[30]/J9[12]/P4_3-FC6_I2S_TX_WS */
#define BOARD_INITKEYBOARDPINS_FC6_I2S_TX_WS_PERIPHERAL                FLEXCOMM6   /*!< Device name: FLEXCOMM6 */
#define BOARD_INITKEYBOARDPINS_FC6_I2S_TX_WS_SIGNAL              TXD_SCL_MISO_WS   /*!< FLEXCOMM6 signal: TXD_SCL_MISO_WS */
#define BOARD_INITKEYBOARDPINS_FC6_I2S_TX_WS_PIN_NAME        FC6_TXD_SCL_MISO_WS   /*!< Pin name */
#define BOARD_INITKEYBOARDPINS_FC6_I2S_TX_WS_LABEL "U10[30]/J9[12]/P4_3-FC6_I2S_TX_WS" /*!< Label */
#define BOARD_INITKEYBOARDPINS_FC6_I2S_TX_WS_NAME                "FC6_I2S_TX_WS"   /*!< Identifier name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitKeyboardPins(void); /* Function assigned for the Cortex-M4F */

/* PIO0_16 (coord M4), Charger enable pin */
#define BOARD_INITCHARGEPINS_CHG_EN_GPIO                                    GPIO   /*!< GPIO device name: GPIO */
#define BOARD_INITCHARGEPINS_CHG_EN_PORT                                      0U   /*!< PORT device index: 0 */
#define BOARD_INITCHARGEPINS_CHG_EN_GPIO_PIN                                 16U   /*!< PIO0 pin index: 16 */
#define BOARD_INITCHARGEPINS_CHG_EN_PIN_NAME                             PIO0_16   /*!< Pin name */
#define BOARD_INITCHARGEPINS_CHG_EN_LABEL                   "Charger enable pin"   /*!< Label */
#define BOARD_INITCHARGEPINS_CHG_EN_NAME                                "CHG_EN"   /*!< Identifier name */

/* PIO1_0 (coord N3), Charger detect pin */
#define BOARD_INITCHARGEPINS_CHG_DET_GPIO                                   GPIO   /*!< GPIO device name: GPIO */
#define BOARD_INITCHARGEPINS_CHG_DET_PORT                                     1U   /*!< PORT device index: 1 */
#define BOARD_INITCHARGEPINS_CHG_DET_GPIO_PIN                                 0U   /*!< PIO1 pin index: 0 */
#define BOARD_INITCHARGEPINS_CHG_DET_PIN_NAME                             PIO1_0   /*!< Pin name */
#define BOARD_INITCHARGEPINS_CHG_DET_LABEL                  "Charger detect pin"   /*!< Label */
#define BOARD_INITCHARGEPINS_CHG_DET_NAME                              "CHG_DET"   /*!< Identifier name */

/* PIO1_18 (coord D1), Fuel Gauge int pin */
#define BOARD_INITCHARGEPINS_FG_INT_GPIO                                    GPIO   /*!< GPIO device name: GPIO */
#define BOARD_INITCHARGEPINS_FG_INT_PORT                                      1U   /*!< PORT device index: 1 */
#define BOARD_INITCHARGEPINS_FG_INT_GPIO_PIN                                 18U   /*!< PIO1 pin index: 18 */
#define BOARD_INITCHARGEPINS_FG_INT_PIN_NAME                             PIO1_18   /*!< Pin name */
#define BOARD_INITCHARGEPINS_FG_INT_LABEL                   "Fuel Gauge int pin"   /*!< Label */
#define BOARD_INITCHARGEPINS_FG_INT_NAME                                "FG_INT"   /*!< Identifier name */

/* FC6_RXD_SDA_MOSI_DATA (coord F14), U10[32]/J9[10]/P4_2-FC6_I2S_TX_DATA */
#define BOARD_INITCHARGEPINS_FC6_I2S_TX_DATA_PERIPHERAL                FLEXCOMM6   /*!< Device name: FLEXCOMM6 */
#define BOARD_INITCHARGEPINS_FC6_I2S_TX_DATA_SIGNAL            RXD_SDA_MOSI_DATA   /*!< FLEXCOMM6 signal: RXD_SDA_MOSI_DATA */
#define BOARD_INITCHARGEPINS_FC6_I2S_TX_DATA_PIN_NAME      FC6_RXD_SDA_MOSI_DATA   /*!< Pin name */
#define BOARD_INITCHARGEPINS_FC6_I2S_TX_DATA_LABEL "U10[32]/J9[10]/P4_2-FC6_I2S_TX_DATA" /*!< Label */
#define BOARD_INITCHARGEPINS_FC6_I2S_TX_DATA_NAME              "FC6_I2S_TX_DATA"   /*!< Identifier name */

/* FC6_TXD_SCL_MISO_WS (coord F13), U10[30]/J9[12]/P4_3-FC6_I2S_TX_WS */
#define BOARD_INITCHARGEPINS_FC6_I2S_TX_WS_PERIPHERAL                  FLEXCOMM6   /*!< Device name: FLEXCOMM6 */
#define BOARD_INITCHARGEPINS_FC6_I2S_TX_WS_SIGNAL                TXD_SCL_MISO_WS   /*!< FLEXCOMM6 signal: TXD_SCL_MISO_WS */
#define BOARD_INITCHARGEPINS_FC6_I2S_TX_WS_PIN_NAME          FC6_TXD_SCL_MISO_WS   /*!< Pin name */
#define BOARD_INITCHARGEPINS_FC6_I2S_TX_WS_LABEL "U10[30]/J9[12]/P4_3-FC6_I2S_TX_WS" /*!< Label */
#define BOARD_INITCHARGEPINS_FC6_I2S_TX_WS_NAME                  "FC6_I2S_TX_WS"   /*!< Identifier name */

/* ADC0_0 (coord P2), Battery Temperature detect */
#define BOARD_INITCHARGEPINS_SWO_TRGT_PERIPHERAL                            ADC0   /*!< Device name: ADC0 */
#define BOARD_INITCHARGEPINS_SWO_TRGT_SIGNAL                                  CH   /*!< ADC0 signal: CH */
#define BOARD_INITCHARGEPINS_SWO_TRGT_CHANNEL                                  0   /*!< ADC0 channel: 0 */
#define BOARD_INITCHARGEPINS_SWO_TRGT_PIN_NAME                            ADC0_0   /*!< Pin name */
#define BOARD_INITCHARGEPINS_SWO_TRGT_LABEL         "Battery Temperature detect"   /*!< Label */
#define BOARD_INITCHARGEPINS_SWO_TRGT_NAME                            "SWO_TRGT"   /*!< Identifier name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitChargePins(void); /* Function assigned for the Cortex-M4F */

/* PIO0_17 (coord E14), WiFi chip power down pin */
#define BOARD_INITWIFIPINS_WIFI_CHIP_PWD_GPIO                               GPIO   /*!< GPIO device name: GPIO */
#define BOARD_INITWIFIPINS_WIFI_CHIP_PWD_PORT                                 0U   /*!< PORT device index: 0 */
#define BOARD_INITWIFIPINS_WIFI_CHIP_PWD_GPIO_PIN                            17U   /*!< PIO0 pin index: 17 */
#define BOARD_INITWIFIPINS_WIFI_CHIP_PWD_PIN_NAME                        PIO0_17   /*!< Pin name */
#define BOARD_INITWIFIPINS_WIFI_CHIP_PWD_LABEL        "WiFi chip power down pin"   /*!< Label */
#define BOARD_INITWIFIPINS_WIFI_CHIP_PWD_NAME                    "WIFI_CHIP_PWD"   /*!< Identifier name */

/* PIO0_29 (coord B13), WiFi int pin */
#define BOARD_INITWIFIPINS_WIFI_INT_GPIO                                    GPIO   /*!< GPIO device name: GPIO */
#define BOARD_INITWIFIPINS_WIFI_INT_PORT                                      0U   /*!< PORT device index: 0 */
#define BOARD_INITWIFIPINS_WIFI_INT_GPIO_PIN                                 29U   /*!< PIO0 pin index: 29 */
#define BOARD_INITWIFIPINS_WIFI_INT_PIN_NAME                             PIO0_29   /*!< Pin name */
#define BOARD_INITWIFIPINS_WIFI_INT_LABEL                         "WiFi int pin"   /*!< Label */
#define BOARD_INITWIFIPINS_WIFI_INT_NAME                              "WIFI_INT"   /*!< Identifier name */

/* PIO0_30 (coord A2), WiFi mode select pin */
#define BOARD_INITWIFIPINS_WIFI_HM0_GPIO                                    GPIO   /*!< GPIO device name: GPIO */
#define BOARD_INITWIFIPINS_WIFI_HM0_PORT                                      0U   /*!< PORT device index: 0 */
#define BOARD_INITWIFIPINS_WIFI_HM0_GPIO_PIN                                 30U   /*!< PIO0 pin index: 30 */
#define BOARD_INITWIFIPINS_WIFI_HM0_PIN_NAME                             PIO0_30   /*!< Pin name */
#define BOARD_INITWIFIPINS_WIFI_HM0_LABEL                 "WiFi mode select pin"   /*!< Label */
#define BOARD_INITWIFIPINS_WIFI_HM0_NAME                              "WIFI_HM0"   /*!< Identifier name */

/* FC3_RXD_SDA_MOSI (coord K12), WiFi SPI MOSI pin */
#define BOARD_INITWIFIPINS_WIFI_SPI_MOSI_PERIPHERAL                    FLEXCOMM3   /*!< Device name: FLEXCOMM3 */
#define BOARD_INITWIFIPINS_WIFI_SPI_MOSI_SIGNAL                     RXD_SDA_MOSI   /*!< FLEXCOMM3 signal: RXD_SDA_MOSI */
#define BOARD_INITWIFIPINS_WIFI_SPI_MOSI_PIN_NAME               FC3_RXD_SDA_MOSI   /*!< Pin name */
#define BOARD_INITWIFIPINS_WIFI_SPI_MOSI_LABEL               "WiFi SPI MOSI pin"   /*!< Label */
#define BOARD_INITWIFIPINS_WIFI_SPI_MOSI_NAME                    "WIFI_SPI_MOSI"   /*!< Identifier name */

/* FC3_SSEL3 (coord N14), WiFi SPI CS pin */
#define BOARD_INITWIFIPINS_WIFI_SPI_CS_PERIPHERAL                      FLEXCOMM3   /*!< Device name: FLEXCOMM3 */
#define BOARD_INITWIFIPINS_WIFI_SPI_CS_SIGNAL                              SSEL3   /*!< FLEXCOMM3 signal: SSEL3 */
#define BOARD_INITWIFIPINS_WIFI_SPI_CS_PIN_NAME                        FC3_SSEL3   /*!< Pin name */
#define BOARD_INITWIFIPINS_WIFI_SPI_CS_LABEL                   "WiFi SPI CS pin"   /*!< Label */
#define BOARD_INITWIFIPINS_WIFI_SPI_CS_NAME                        "WIFI_SPI_CS"   /*!< Identifier name */

/* FC3_TXD_SCL_MISO (coord P12), WiFi SPI MISO pin */
#define BOARD_INITWIFIPINS_WIFI_SPI_MISO_PERIPHERAL                    FLEXCOMM3   /*!< Device name: FLEXCOMM3 */
#define BOARD_INITWIFIPINS_WIFI_SPI_MISO_SIGNAL                     TXD_SCL_MISO   /*!< FLEXCOMM3 signal: TXD_SCL_MISO */
#define BOARD_INITWIFIPINS_WIFI_SPI_MISO_PIN_NAME               FC3_TXD_SCL_MISO   /*!< Pin name */
#define BOARD_INITWIFIPINS_WIFI_SPI_MISO_LABEL               "WiFi SPI MISO pin"   /*!< Label */
#define BOARD_INITWIFIPINS_WIFI_SPI_MISO_NAME                    "WIFI_SPI_MISO"   /*!< Identifier name */

