sunklCoin/MCU/board/pin_mux.h
/* FC3_SCK (coord H11), WiFi SPI CLK pin */
#define BOARD_INITWIFIPINS_WIFI_SPI_CLK_PERIPHERAL                     FLEXCOMM3   /*!< Device name: FLEXCOMM3 */
#define BOARD_INITWIFIPINS_WIFI_SPI_CLK_SIGNAL                               SCK   /*!< FLEXCOMM3 signal: SCK */
#define BOARD_INITWIFIPINS_WIFI_SPI_CLK_PIN_NAME                         FC3_SCK   /*!< Pin name */
#define BOARD_INITWIFIPINS_WIFI_SPI_CLK_LABEL                 "WiFi SPI CLK pin"   /*!< Label */
#define BOARD_INITWIFIPINS_WIFI_SPI_CLK_NAME                      "WIFI_SPI_CLK"   /*!< Identifier name */

/* PIO3_12 (coord L2), WiFi wake up pin */
#define BOARD_INITWIFIPINS_WIFI_WAKEUP_GPIO                                 GPIO   /*!< GPIO device name: GPIO */
#define BOARD_INITWIFIPINS_WIFI_WAKEUP_PORT                                   3U   /*!< PORT device index: 3 */
#define BOARD_INITWIFIPINS_WIFI_WAKEUP_GPIO_PIN                              12U   /*!< PIO3 pin index: 12 */
#define BOARD_INITWIFIPINS_WIFI_WAKEUP_PIN_NAME                          PIO3_12   /*!< Pin name */
#define BOARD_INITWIFIPINS_WIFI_WAKEUP_LABEL                  "WiFi wake up pin"   /*!< Label */
#define BOARD_INITWIFIPINS_WIFI_WAKEUP_NAME                        "WIFI_WAKEUP"   /*!< Identifier name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitWiFiPins(void); /* Function assigned for the Cortex-M4F */

/* PIO0_31 (coord M5), BLE int pin */
#define BOARD_INITBLEPINS_BT_INT_GPIO                                       GPIO   /*!< GPIO device name: GPIO */
#define BOARD_INITBLEPINS_BT_INT_PORT                                         0U   /*!< PORT device index: 0 */
#define BOARD_INITBLEPINS_BT_INT_GPIO_PIN                                    31U   /*!< PIO0 pin index: 31 */
#define BOARD_INITBLEPINS_BT_INT_PIN_NAME                                PIO0_31   /*!< Pin name */
#define BOARD_INITBLEPINS_BT_INT_LABEL                             "BLE int pin"   /*!< Label */
#define BOARD_INITBLEPINS_BT_INT_NAME                                   "BT_INT"   /*!< Identifier name */

/* PIO3_14 (coord E3), BLE wake up pin */
#define BOARD_INITBLEPINS_BT_WAKEUP_GPIO                                    GPIO   /*!< GPIO device name: GPIO */
#define BOARD_INITBLEPINS_BT_WAKEUP_PORT                                      3U   /*!< PORT device index: 3 */
#define BOARD_INITBLEPINS_BT_WAKEUP_GPIO_PIN                                 14U   /*!< PIO3 pin index: 14 */
#define BOARD_INITBLEPINS_BT_WAKEUP_PIN_NAME                             PIO3_14   /*!< Pin name */
#define BOARD_INITBLEPINS_BT_WAKEUP_LABEL                      "BLE wake up pin"   /*!< Label */
#define BOARD_INITBLEPINS_BT_WAKEUP_NAME                             "BT_WAKEUP"   /*!< Identifier name */

/* FC8_RXD_SDA_MOSI (coord E1), BLE uart rx */
#define BOARD_INITBLEPINS_BT_UART_RX_PERIPHERAL                        FLEXCOMM8   /*!< Device name: FLEXCOMM8 */
#define BOARD_INITBLEPINS_BT_UART_RX_SIGNAL                         RXD_SDA_MOSI   /*!< FLEXCOMM8 signal: RXD_SDA_MOSI */
#define BOARD_INITBLEPINS_BT_UART_RX_PIN_NAME                   FC8_RXD_SDA_MOSI   /*!< Pin name */
#define BOARD_INITBLEPINS_BT_UART_RX_LABEL                         "BLE uart rx"   /*!< Label */
#define BOARD_INITBLEPINS_BT_UART_RX_NAME                           "BT_UART_RX"   /*!< Identifier name */

/* FC8_TXD_SCL_MISO (coord K1), BLE uart tx */
#define BOARD_INITBLEPINS_BT_UART_TX_PERIPHERAL                        FLEXCOMM8   /*!< Device name: FLEXCOMM8 */
#define BOARD_INITBLEPINS_BT_UART_TX_SIGNAL                         TXD_SCL_MISO   /*!< FLEXCOMM8 signal: TXD_SCL_MISO */
#define BOARD_INITBLEPINS_BT_UART_TX_PIN_NAME                   FC8_TXD_SCL_MISO   /*!< Pin name */
#define BOARD_INITBLEPINS_BT_UART_TX_LABEL                         "BLE uart tx"   /*!< Label */
#define BOARD_INITBLEPINS_BT_UART_TX_NAME                           "BT_UART_TX"   /*!< Identifier name */

/* PIO3_19 (coord J3), BLE STA pin */
#define BOARD_INITBLEPINS_BT_STA_GPIO                                       GPIO   /*!< GPIO device name: GPIO */
#define BOARD_INITBLEPINS_BT_STA_PORT                                         3U   /*!< PORT device index: 3 */
#define BOARD_INITBLEPINS_BT_STA_GPIO_PIN                                    19U   /*!< PIO3 pin index: 19 */
#define BOARD_INITBLEPINS_BT_STA_PIN_NAME                                PIO3_19   /*!< Pin name */
#define BOARD_INITBLEPINS_BT_STA_LABEL                             "BLE STA pin"   /*!< Label */
#define BOARD_INITBLEPINS_BT_STA_NAME                                   "BT_STA"   /*!< Identifier name */

/* PIO3_26 (coord K5), BLE STA1 pin */
#define BOARD_INITBLEPINS_BT_STA1_GPIO                                      GPIO   /*!< GPIO device name: GPIO */
#define BOARD_INITBLEPINS_BT_STA1_PORT                                        3U   /*!< PORT device index: 3 */
#define BOARD_INITBLEPINS_BT_STA1_GPIO_PIN                                   26U   /*!< PIO3 pin index: 26 */
#define BOARD_INITBLEPINS_BT_STA1_PIN_NAME                               PIO3_26   /*!< Pin name */
#define BOARD_INITBLEPINS_BT_STA1_LABEL                           "BLE STA1 pin"   /*!< Label */
#define BOARD_INITBLEPINS_BT_STA1_NAME                                 "BT_STA1"   /*!< Identifier name */

/* PIO3_27 (coord P14), BLE reset pin */
#define BOARD_INITBLEPINS_BT_RST_GPIO                                       GPIO   /*!< GPIO device name: GPIO */
#define BOARD_INITBLEPINS_BT_RST_PORT                                         3U   /*!< PORT device index: 3 */
#define BOARD_INITBLEPINS_BT_RST_GPIO_PIN                                    27U   /*!< PIO3 pin index: 27 */
#define BOARD_INITBLEPINS_BT_RST_PIN_NAME                                PIO3_27   /*!< Pin name */
#define BOARD_INITBLEPINS_BT_RST_LABEL                           "BLE reset pin"   /*!< Label */
#define BOARD_INITBLEPINS_BT_RST_NAME                                   "BT_RST"   /*!< Identifier name */

/* PIO3_29 (coord L13), BLE reset1 pin */
#define BOARD_INITBLEPINS_BT_RST1_GPIO                                      GPIO   /*!< GPIO device name: GPIO */
#define BOARD_INITBLEPINS_BT_RST1_PORT                                        3U   /*!< PORT device index: 3 */
#define BOARD_INITBLEPINS_BT_RST1_GPIO_PIN                                   29U   /*!< PIO3 pin index: 29 */
#define BOARD_INITBLEPINS_BT_RST1_PIN_NAME                               PIO3_29   /*!< Pin name */
#define BOARD_INITBLEPINS_BT_RST1_LABEL                         "BLE reset1 pin"   /*!< Label */
#define BOARD_INITBLEPINS_BT_RST1_NAME                                 "BT_RST1"   /*!< Identifier name */

