sunklCoin/MCU/board/pin_mux.h
/* PIO3_15 (coord D2), BLE reserved */
#define BOARD_INITBLEPINS_BT_REV_GPIO                                       GPIO   /*!< GPIO device name: GPIO */
#define BOARD_INITBLEPINS_BT_REV_PORT                                         3U   /*!< PORT device index: 3 */
#define BOARD_INITBLEPINS_BT_REV_GPIO_PIN                                    15U   /*!< PIO3 pin index: 15 */
#define BOARD_INITBLEPINS_BT_REV_PIN_NAME                                PIO3_15   /*!< Pin name */
#define BOARD_INITBLEPINS_BT_REV_LABEL                            "BLE reserved"   /*!< Label */
#define BOARD_INITBLEPINS_BT_REV_NAME                                   "BT_REV"   /*!< Identifier name */

/* PIO3_18 (coord M6), BLE reserved */
#define BOARD_INITBLEPINS_BT_REV1_GPIO                                      GPIO   /*!< GPIO device name: GPIO */
#define BOARD_INITBLEPINS_BT_REV1_PORT                                        3U   /*!< PORT device index: 3 */
#define BOARD_INITBLEPINS_BT_REV1_GPIO_PIN                                   18U   /*!< PIO3 pin index: 18 */
#define BOARD_INITBLEPINS_BT_REV1_PIN_NAME                               PIO3_18   /*!< Pin name */
#define BOARD_INITBLEPINS_BT_REV1_LABEL                           "BLE reserved"   /*!< Label */
#define BOARD_INITBLEPINS_BT_REV1_NAME                                 "BT_REV1"   /*!< Identifier name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBlePins(void); /* Function assigned for the Cortex-M4F */

/* PIO1_17 (coord N12), Touchpanel int pin */
#define BOARD_INITTOUCHPANELPINS_TP_INT_GPIO                                GPIO   /*!< GPIO device name: GPIO */
#define BOARD_INITTOUCHPANELPINS_TP_INT_PORT                                  1U   /*!< PORT device index: 1 */
#define BOARD_INITTOUCHPANELPINS_TP_INT_GPIO_PIN                             17U   /*!< PIO1 pin index: 17 */
#define BOARD_INITTOUCHPANELPINS_TP_INT_PIN_NAME                         PIO1_17   /*!< Pin name */
#define BOARD_INITTOUCHPANELPINS_TP_INT_LABEL               "Touchpanel int pin"   /*!< Label */
#define BOARD_INITTOUCHPANELPINS_TP_INT_NAME                            "TP_INT"   /*!< Identifier name */

/* PIO2_27 (coord H14), Touchpanel reset pin */
#define BOARD_INITTOUCHPANELPINS_TP_RST_GPIO                                GPIO   /*!< GPIO device name: GPIO */
#define BOARD_INITTOUCHPANELPINS_TP_RST_PORT                                  2U   /*!< PORT device index: 2 */
#define BOARD_INITTOUCHPANELPINS_TP_RST_GPIO_PIN                             27U   /*!< PIO2 pin index: 27 */
#define BOARD_INITTOUCHPANELPINS_TP_RST_PIN_NAME                         PIO2_27   /*!< Pin name */
#define BOARD_INITTOUCHPANELPINS_TP_RST_LABEL             "Touchpanel reset pin"   /*!< Label */
#define BOARD_INITTOUCHPANELPINS_TP_RST_NAME                            "TP_RST"   /*!< Identifier name */

/* FC2_CTS_SDA_SSEL0 (coord C2), J11[10]/J9[3]/U10[3]/J17[5]/U19[10]/P3_23-FC2_SDAX */
#define BOARD_INITTOUCHPANELPINS_FC2_SDAX_PERIPHERAL                   FLEXCOMM2   /*!< Device name: FLEXCOMM2 */
#define BOARD_INITTOUCHPANELPINS_FC2_SDAX_SIGNAL                   CTS_SDA_SSEL0   /*!< FLEXCOMM2 signal: CTS_SDA_SSEL0 */
#define BOARD_INITTOUCHPANELPINS_FC2_SDAX_PIN_NAME             FC2_CTS_SDA_SSEL0   /*!< Pin name */
#define BOARD_INITTOUCHPANELPINS_FC2_SDAX_LABEL "J11[10]/J9[3]/U10[3]/J17[5]/U19[10]/P3_23-FC2_SDAX" /*!< Label */
#define BOARD_INITTOUCHPANELPINS_FC2_SDAX_NAME                        "FC2_SDAX"   /*!< Identifier name */

/* FC2_RTS_SCL_SSEL1 (coord E2), J11[9]/J9[1]/U10[2]/J17[4]/U19[2]/P3_24-FC2_SCLX */
#define BOARD_INITTOUCHPANELPINS_FC2_SCLX_PERIPHERAL                   FLEXCOMM2   /*!< Device name: FLEXCOMM2 */
#define BOARD_INITTOUCHPANELPINS_FC2_SCLX_SIGNAL                   RTS_SCL_SSEL1   /*!< FLEXCOMM2 signal: RTS_SCL_SSEL1 */
#define BOARD_INITTOUCHPANELPINS_FC2_SCLX_PIN_NAME             FC2_RTS_SCL_SSEL1   /*!< Pin name */
#define BOARD_INITTOUCHPANELPINS_FC2_SCLX_LABEL "J11[9]/J9[1]/U10[2]/J17[4]/U19[2]/P3_24-FC2_SCLX" /*!< Label */
#define BOARD_INITTOUCHPANELPINS_FC2_SCLX_NAME                        "FC2_SCLX"   /*!< Identifier name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitTouchpanelPins(void); /* Function assigned for the Cortex-M4F */

/* PIO2_2 (coord C3), Zigbee reset pin */
#define BOARD_INITZIGBEEPINS_ZB_RST_GPIO                                    GPIO   /*!< GPIO device name: GPIO */
#define BOARD_INITZIGBEEPINS_ZB_RST_PORT                                      2U   /*!< PORT device index: 2 */
#define BOARD_INITZIGBEEPINS_ZB_RST_GPIO_PIN                                  2U   /*!< PIO2 pin index: 2 */
#define BOARD_INITZIGBEEPINS_ZB_RST_PIN_NAME                              PIO2_2   /*!< Pin name */
#define BOARD_INITZIGBEEPINS_ZB_RST_LABEL                     "Zigbee reset pin"   /*!< Label */
#define BOARD_INITZIGBEEPINS_ZB_RST_NAME                                "ZB_RST"   /*!< Identifier name */

/* FC1_RXD_SDA_MOSI (coord B1), Zigbee uart rx */
#define BOARD_INITZIGBEEPINS_ZB_UART_RX_PERIPHERAL                     FLEXCOMM1   /*!< Device name: FLEXCOMM1 */
#define BOARD_INITZIGBEEPINS_ZB_UART_RX_SIGNAL                      RXD_SDA_MOSI   /*!< FLEXCOMM1 signal: RXD_SDA_MOSI */
#define BOARD_INITZIGBEEPINS_ZB_UART_RX_PIN_NAME                FC1_RXD_SDA_MOSI   /*!< Pin name */
#define BOARD_INITZIGBEEPINS_ZB_UART_RX_LABEL                   "Zigbee uart rx"   /*!< Label */
#define BOARD_INITZIGBEEPINS_ZB_UART_RX_NAME                        "ZB_UART_RX"   /*!< Identifier name */

/* FC1_TXD_SCL_MISO (coord D3), Zigbee uart tx */
#define BOARD_INITZIGBEEPINS_ZB_UART_TX_PERIPHERAL                     FLEXCOMM1   /*!< Device name: FLEXCOMM1 */
#define BOARD_INITZIGBEEPINS_ZB_UART_TX_SIGNAL                      TXD_SCL_MISO   /*!< FLEXCOMM1 signal: TXD_SCL_MISO */
#define BOARD_INITZIGBEEPINS_ZB_UART_TX_PIN_NAME                FC1_TXD_SCL_MISO   /*!< Pin name */
#define BOARD_INITZIGBEEPINS_ZB_UART_TX_LABEL                   "Zigbee uart tx"   /*!< Label */
#define BOARD_INITZIGBEEPINS_ZB_UART_TX_NAME                        "ZB_UART_TX"   /*!< Identifier name */

/* FC1_CTS_SDA_SSEL0 (coord C1), Zigbee uart cts */
#define BOARD_INITZIGBEEPINS_ZB_UART_CTS_PERIPHERAL                    FLEXCOMM1   /*!< Device name: FLEXCOMM1 */
#define BOARD_INITZIGBEEPINS_ZB_UART_CTS_SIGNAL                    CTS_SDA_SSEL0   /*!< FLEXCOMM1 signal: CTS_SDA_SSEL0 */
#define BOARD_INITZIGBEEPINS_ZB_UART_CTS_PIN_NAME              FC1_CTS_SDA_SSEL0   /*!< Pin name */
#define BOARD_INITZIGBEEPINS_ZB_UART_CTS_LABEL                 "Zigbee uart cts"   /*!< Label */
#define BOARD_INITZIGBEEPINS_ZB_UART_CTS_NAME                      "ZB_UART_CTS"   /*!< Identifier name */

/* FC1_RTS_SCL_SSEL1 (coord F3), Zigbee uart rts */
#define BOARD_INITZIGBEEPINS_ZB_UART_RTS_PERIPHERAL                    FLEXCOMM1   /*!< Device name: FLEXCOMM1 */
#define BOARD_INITZIGBEEPINS_ZB_UART_RTS_SIGNAL                    RTS_SCL_SSEL1   /*!< FLEXCOMM1 signal: RTS_SCL_SSEL1 */
#define BOARD_INITZIGBEEPINS_ZB_UART_RTS_PIN_NAME              FC1_RTS_SCL_SSEL1   /*!< Pin name */
#define BOARD_INITZIGBEEPINS_ZB_UART_RTS_LABEL                 "Zigbee uart rts"   /*!< Label */
#define BOARD_INITZIGBEEPINS_ZB_UART_RTS_NAME                      "ZB_UART_RTS"   /*!< Identifier name */

/* PIO2_10 (coord P1), Zigbee uart mode select */
#define BOARD_INITZIGBEEPINS_ZB_UART_MODE_GPIO                              GPIO   /*!< GPIO device name: GPIO */
#define BOARD_INITZIGBEEPINS_ZB_UART_MODE_PORT                                2U   /*!< PORT device index: 2 */
#define BOARD_INITZIGBEEPINS_ZB_UART_MODE_GPIO_PIN                           10U   /*!< PIO2 pin index: 10 */
#define BOARD_INITZIGBEEPINS_ZB_UART_MODE_PIN_NAME                       PIO2_10   /*!< Pin name */
#define BOARD_INITZIGBEEPINS_ZB_UART_MODE_LABEL        "Zigbee uart mode select"   /*!< Label */
#define BOARD_INITZIGBEEPINS_ZB_UART_MODE_NAME                    "ZB_UART_MODE"   /*!< Identifier name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitZigbeePins(void); /* Function assigned for the Cortex-M4F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/*******************************************************************************
 * EOF
 ******************************************************************************/
